{"pages":[],"posts":[{"title":"网页打印显示背景图或背景色","text":"公司以前的项目要增加一个生成报表要加上水印的功能，并且能够要打印出来。很简单的小功能，用个一个插件就搞定了，很easy！ 水印很简单的搞出来了，但是在打印页面的时候却发现了问题，打印预览里没有我新增的水印。 以为是浏览器打印设置没有勾选打印背景，打开设置一看，明明是选中状态。然后就是愉快的找原因时间，一开始以为是结构或者CSS的原因，没有显示的完整或者遮挡住了，但是一想不对，如果是这种原因那岂不是页面上也不看不到水印了，陷入了迷茫~~~。 然后就在愁眉不展的时候，在浏览器里随便调试，发现了这个项目里用了Bootstrap,然后把这个link标签删除了一试，竟然在打印预览里出现了水印！马上就打开了bootstrap.css的源码，发现它里面有个坑爹样式： @media print { * { color: #000 !important; text-shadow: none !important; background: transparent !important; box-shadow: none !important } a, a:visited { text-decoration: underline } ... } Bootstrap里会在浏览器打印的时候，让背景会变成透明色，因为之前的水印是JS生成的一张base64的背景图片，所以变成透明色以后，就再也不会出现水印了，真的是一个坑，找到这个原因，花了不少原因(◐_◑)。 把这行代码注释了，就没问题了，别问我为啥还用bootstrap，以前的项目而且还不是我做的，木有办法啊。","path":"2018/10/19/网页打印显示背景图或背景色/"},{"title":"vue挖坑指南（一）","text":"因为业务需求，公司想要用Vue.js来开发项目。但是之前从来没有接触过类似框架，也不想去招个会Vue.js的前端，所以让我来挖挖坑(:зゝ∠)。 初识 Vue.js需要用node.js来配合食用，老实说搞的云里雾里的，各种报错让人想砸电脑。明明各位大佬的教程里，很优雅的敲下一行命令行就完事的事情，我却要鼓捣半天，反而报错报的怀疑人生。 在理解了官网上的一些例子以后，为了更好的深入了解Vue的魅力，特意去从网上找了一个项目是webpack + Vue.js + nodeJs 搭建的一个基础项目。 链接地址 ==&gt; Vue2+VueRouter2+webpack+vue-cil构建完整项目 然后就是悲剧的开始，按照教程一步步走过来，期间有些小问题自己百度百度解决了，最后终于要成功跑起项目的时候，在webpack打包的时候就报错了Orz。然后研究发现是webpack版本更新了以后，vue-loader要在webpack.config.js里重新配置一下，老版本是不需要配置的。满心欢喜以为总算可以跑起来了，现实还是狠狠的给了我一记老拳。 弃坑 毫不犹豫就弃坑，再见Vue！！ 当然是开玩笑的，但是发现一步步自己搭建Vue项目真的坑太多，所以决定用vue-cli这个脚手架来直接搭建，官网上说建议自己先一步步搭建，再用vue-cli来创建项目，但是坑实在太多让我不得不选择这种方式。 npm install --global vue-cli //全局安装vue-cli 轻松愉快~~ 最后使用 vue -V 检查是否安装成功。 创建一个vue项目，命令执行之后，会在当前目录生成一个以该名称命名的项目文件夹。 vue init webpack vueDemo //vueDemo是项目名 之后会跳出几个选项让你回答： 具体的按照个人的需求来决定，而且后期也能修改。值得注意的是Project name 必须小写不然会报错。然后就是下载一些文件了，耐心等待即可。 激动人心的时刻到来了！！ cd vueDemo //进入项目文件夹 npm run dev //启动项目 启动成功了！！！ヾ(≧O≦)〃嗷~ 最后打开浏览器，输入 http://localhost:8080 就可以了！ 结语初次尝试花费了一定的功夫，但是不得不说用了脚手架以后十分方便，创建一个项目只要优雅的敲几个命令行就可以安心喝茶了，这也让我更加期待Vue的大显身手。","path":"2018/09/25/vue挖坑指南/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2018/06/11/hello-world/"}]}